Repository: airparkchen/testBlack
Catalog: lib/shared/config/language/app_*.arb
Languages: ar

# appTitle
source: Wi-Fi 5G IOT APP
ar: تطبيق إنترنت الأشياء واي فاي 5G

source: Search
ar: بحث

source: Connect
ar: اتصال

source: Settings
ar: إعدادات

source: Login
ar: تسجيل الدخول

source: Password
ar: كلمة المرور

source: Account
ar: الحساب

source: Next
ar: التالي

source: Back
ar: رجوع

source: Set SSID
ar: تعيين SSID

source: Security Option
ar: خيار الأمان

source: Set Internet
ar: إعداد الإنترنت

source: Connection Type
ar: نوع الاتصال

source: IP Address
ar: عنوان IP

source: Gateway
ar: البوابة

source: Primary DNS
ar: DNS الأساسي

source: Secondary DNS
ar: DNS الثانوي

source: Static IP
ar: IP ثابت

source: User
ar: المستخدم

source: Search Devices
ar: البحث عن الأجهزة

source: QRcode
ar: رمز QR

source: Manual
ar: يدوي

source: Finishing Wizard
ar: إنهاء المعالج

# languageSelector
source: Language
ar: اللغة

source: Set Password
ar: تعيين كلمة المرور

source: Username
ar: اسم المستخدم

source: Confirm Password
ar: تأكيد كلمة المرور

source: Login failed
ar: فشل تسجيل الدخول

source: Invalid username or password
ar: اسم المستخدم أو كلمة المرور غير صحيحة

source: Network connection failed
ar: فشل الاتصال بالشبكة

source: Connection timeout
ar: انتهت مهلة الاتصال

source: Unauthorized access
ar: وصول غير مصرح به

source: Access forbidden
ar: الوصول محظور

source: Logging in
ar: جاري تسجيل الدخول

source: Login successful
ar: تم تسجيل الدخول بنجاح

# pleaseEnterPassword
source: Please enter a password
ar: يرجى إدخال كلمة المرور

source: Your password must be at least 8 characters
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل

# pleaseEnterUsername
source: Please enter a username
ar: يرجى إدخال اسم المستخدم

# pleaseConfirmPassword
source: Please confirm your password
ar: يرجى تأكيد كلمة المرور

# passwordTooShort
source: Password must be at least 8 characters
ar: يجب أن تكون كلمة المرور 8 أحرف على الأقل

# passwordTooLong
source: Password must be 32 characters or less
ar: يجب أن تكون كلمة المرور 32 حرفاً أو أقل

source: Password contains invalid characters
ar: كلمة المرور تحتوي على أحرف غير صالحة

# passwordMustContainUppercase
source: Password must contain at least one uppercase letter
ar: يجب أن تحتوي كلمة المرور على حرف كبير واحد على الأقل

# passwordMustContainLowercase
source: Password must contain at least one lowercase letter
ar: يجب أن تحتوي كلمة المرور على حرف صغير واحد على الأقل

# passwordMustContainDigit
source: Password must contain at least one digit
ar: يجب أن تحتوي كلمة المرور على رقم واحد على الأقل

# passwordMustContainSpecialCharacter
source: Password must contain at least one special character
ar: يجب أن تحتوي كلمة المرور على رمز خاص واحد على الأقل

source: Passwords do not match
ar: كلمات المرور غير متطابقة

source: Please complete all required fields
ar: يرجى إكمال جميع الحقول المطلوبة

# pleaseEnterSSID
source: Please enter an SSID
ar: يرجى إدخال SSID

# ssidTooLong
source: SSID must be 64 characters or less
ar: يجب أن يكون SSID 64 حرفاً أو أقل

source: SSID contains invalid characters
ar: SSID يحتوي على أحرف غير صالحة

source: WiFi Password
ar: كلمة مرور WiFi

source: no authentication
ar: بدون مصادقة

# enhancedOpen
source: Enhanced Open (OWE)
ar: مفتوح محسن (OWE)

source: WPA2 Personal
ar: WPA2 شخصي

source: WPA3 Personal
ar: WPA3 شخصي

source: WPA2/WPA3 Personal
ar: WPA2/WPA3 شخصي

source: WPA2 Enterprise
ar: WPA2 مؤسسي

source: IP Subnet Mask
ar: قناع الشبكة الفرعية IP

source: Gateway IP Address
ar: عنوان IP للبوابة

# pleaseEnterIpAddress
source: Please enter an IP address
ar: يرجى إدخال عنوان IP

# pleaseEnterSubnetMask
source: Please enter a subnet mask
ar: يرجى إدخال قناع الشبكة الفرعية

# pleaseEnterGatewayAddress
source: Please enter a gateway address
ar: يرجى إدخال عنوان البوابة

# pleaseEnterDnsAddress
source: Please enter a DNS server address
ar: يرجى إدخال عنوان خادم DNS

# pleaseEnterValidIpAddress
source: Please enter a valid IP address
ar: يرجى إدخال عنوان IP صالح

# pleaseEnterValidSubnetMask
source: Please enter a valid subnet mask
ar: يرجى إدخال قناع شبكة فرعية صالح

# pleaseEnterValidGatewayAddress
source: Please enter a valid gateway address
ar: يرجى إدخال عنوان بوابة صالح

# pleaseEnterValidDnsAddress
source: Please enter a valid DNS address
ar: يرجى إدخال عنوان DNS صالح

source: PPPoE Username
ar: اسم مستخدم PPPoE

source: PPPoE Password
ar: كلمة مرور PPPoE

# pleaseEnterPppoeUsername
source: Please enter a PPPoE username
ar: يرجى إدخال اسم مستخدم PPPoE

# pleaseEnterPppoePassword
source: Please enter a PPPoE password
ar: يرجى إدخال كلمة مرور PPPoE

source: Summary
ar: الملخص

source: Subnet Mask
ar: قناع الشبكة الفرعية

source: (Not Set)
ar: (غير محدد)

source: Scanning WiFi networks...
ar: جاري البحث عن شبكات WiFi...

source: No WiFi networks found
ar: لم يتم العثور على شبكات WiFi

source: Please scan again
ar: يرجى المسح مرة أخرى

source: WiFi scanning requires location permission
ar: يتطلب مسح WiFi إذن الموقع

# pleaseAllowLocationAndNearbyDevices
source: Please allow "Location" and "Nearby devices" in settings
ar: يرجى السماح بـ "الموقع" و "الأجهزة القريبة" في الإعدادات

source: Device does not support WiFi scanning
ar: الجهاز لا يدعم مسح WiFi

source: Location permission required
ar: إذن الموقع مطلوب

source: Please allow location access
ar: يرجى السماح بالوصول للموقع

source: Location permission denied
ar: تم رفض إذن الموقع

# pleaseManuallyAllowLocationPermission
source: Please manually allow location permission in settings
ar: يرجى السماح بإذن الموقع يدوياً في الإعدادات

source: Precise location permission required
ar: إذن الموقع الدقيق مطلوب

# pleaseSelectPreciseLocation
source: Please select "Precise location" in settings
ar: يرجى تحديد "الموقع الدقيق" في الإعدادات

# pleaseTurnOnLocationService
source: Please turn on location service (GPS)
ar: يرجى تشغيل خدمة الموقع (GPS)

source: WiFi scan failed
ar: فشل مسح WiFi

source: Please try again
ar: يرجى المحاولة مرة أخرى

source: Retry
ar: إعادة المحاولة

source: Open Settings
ar: فتح الإعدادات

source: Connect to WiFi
ar: الاتصال بـ WiFi

# thisNetworkIsPasswordProtected
source: This network is password protected. You will be redirected to WiFi settings to enter the password and connect.
ar: هذه الشبكة محمية بكلمة مرور. سيتم توجيهك إلى إعدادات WiFi لإدخال كلمة المرور والاتصال.

# youWillBeRedirectedToWifiSettings
source: You will be redirected to WiFi settings to connect to this network.
ar: سيتم توجيهك إلى إعدادات WiFi للاتصال بهذه الشبكة.

source: Cancel
ar: إلغاء

source: Redirected to WiFi settings
ar: تم التوجيه إلى إعدادات WiFi

# pleaseSelectToConnect
source: Please select "{ssid}" to connect
ar: يرجى اختيار "{ssid}" للاتصال

source: Unable to open WiFi settings
ar: غير قادر على فتح إعدادات WiFi

source: Please go to Settings manually
ar: يرجى الذهاب إلى الإعدادات يدوياً

source: Unknown Network
ar: شبكة غير معروفة

source: Process 01
ar: العملية 01

source: Process 02
ar: العملية 02

source: Process 03
ar: العملية 03

source: Process 04
ar: العملية 04

source: Process 05
ar: العملية 05

source: Manual Input
ar: إدخال يدوي

source: Scanning...
ar: جاري المسح...

source: Wi-Fi on/off Check
ar: فحص تشغيل/إيقاف WiFi

source: Scan Result
ar: نتيجة المسح

source: Camera initialization failed
ar: فشل تهيئة الكاميرا

source: Please check camera permissions
ar: يرجى فحص أذونات الكاميرا

source: Initializing camera...
ar: جاري تهيئة الكاميرا...

source: Unable to read
ar: غير قادر على القراءة

# unableToScanWifi
source: Unable to scan Wi-Fi, please check permissions
ar: غير قادر على مسح WiFi، يرجى فحص الأذونات

source: Initializing connection...
ar: جاري تهيئة الاتصال...

source: Getting WiFi information...
ar: جاري الحصول على معلومات WiFi...

source: Unable to get valid WiFi SSID
ar: غير قادر على الحصول على SSID WiFi صالح

# pleaseConfirmConnectionToRouter
source: Please confirm connection to router's WiFi
ar: يرجى تأكيد الاتصال بـ WiFi الخاص بالموجه

source: WiFi information obtained
ar: تم الحصول على معلومات WiFi

source: Testing router connection...
ar: جاري اختبار اتصال الموجه...

source: Calculating initial password...
ar: جاري حساب كلمة المرور الأولية...

source: Initial password calculated successfully
ar: تم حساب كلمة المرور الأولية بنجاح

source: Password calculation failed
ar: فشل حساب كلمة المرور

# unableToConnectToRouter
source: Unable to connect to router. Please check network connection
ar: غير قادر على الاتصال بالموجه. يرجى فحص اتصال الشبكة

# unableToGetRouterSerialNumber
source: Unable to get router serial number. Please confirm connection to correct device
ar: غير قادر على الحصول على الرقم التسلسلي للموجه. يرجى تأكيد الاتصال بالجهاز الصحيح

# unableToGetLoginAuthenticationInformation
source: Unable to get login authentication information. Please check router status
ar: غير قادر على الحصول على معلومات مصادقة تسجيل الدخول. يرجى فحص حالة الموجه

source: Performing login...
ar: جاري تسجيل الدخول...

source: Authentication Failed
ar: فشل المصادقة

source: Unable to complete initial authentication
ar: غير قادر على إكمال المصادقة الأولية

source: Getting network settings...
ar: جاري الحصول على إعدادات الشبكة...

source: Network settings obtained
ar: تم الحصول على إعدادات الشبكة

source: Failed to get network settings
ar: فشل في الحصول على إعدادات الشبكة

source: Getting wireless settings...
ar: جاري الحصول على إعدادات اللاسلكي...

source: Wireless settings obtained
ar: تم الحصول على إعدادات اللاسلكي

source: Failed to get wireless settings
ar: فشل في الحصول على إعدادات اللاسلكي

source: Updating network settings...
ar: جاري تحديث إعدادات الشبكة...

source: Network settings updated
ar: تم تحديث إعدادات الشبكة

source: Failed to update network settings
ar: فشل في تحديث إعدادات الشبكة

source: Updating wireless settings...
ar: جاري تحديث إعدادات اللاسلكي...

source: Wireless settings updated
ar: تم تحديث إعدادات اللاسلكي

source: Failed to update wireless settings
ar: فشل في تحديث إعدادات اللاسلكي

source: Changing user password...
ar: جاري تغيير كلمة مرور المستخدم...

source: Password change successful
ar: تم تغيير كلمة المرور بنجاح

source: Password change failed
ar: فشل تغيير كلمة المرور

source: Completing configuration...
ar: جاري إكمال التكوين...

source: Configuration completed
ar: تم إكمال التكوين

# applyingSettingsePleaseWait
source: Applying settings, please wait...
ar: جاري تطبيق الإعدادات، يرجى الانتظار...

source: Failed to apply settings
ar: فشل في تطبيق الإعدادات

source: Connecting to WiFi...
ar: جاري الاتصال بـ WiFi...

source: WiFi connected successfully
ar: تم الاتصال بـ WiFi بنجاح

source: Failed to connect to WiFi
ar: فشل في الاتصال بـ WiFi

source: Connected to wrong WiFi network
ar: متصل بشبكة WiFi خاطئة

source: Error connecting to WiFi
ar: خطأ في الاتصال بـ WiFi

source: Setup Failed
ar: فشل الإعداد

source: Unable to complete setup
ar: غير قادر على إكمال الإعداد

source: WiFi Connection Failed
ar: فشل اتصال WiFi

source: Unable to connect to WiFi
ar: غير قادر على الاتصال بـ WiFi

source: No SSID or password set
ar: لم يتم تعيين SSID أو كلمة مرور

source: OK
ar: موافق

source: Error
ar: خطأ

source: Warning
ar: تحذير

# info
source: Information
ar: معلومات

source: Success
ar: نجح

source: Loading...
ar: جاري التحميل...

source: Please wait...
ar: يرجى الانتظار...

source: No data available
ar: لا توجد بيانات متاحة

source: Operation successful
ar: نجحت العملية

source: Operation failed
ar: فشلت العملية
